blog/2012/02/02/how-to-do-long-twitter-cn.org
#+title: 自己动手做长微博（推特），内嵌图片的
# bhj-tags: tool

看到一个写得很好的网页，想分享给朋友，你可以直接在微博上发个链接，但这
样不如直接把网页转成一张图片发到微博上更能吸引人。

这个在Linux下用开源工具自己就可以做到。

- 安装cups-pdf： ~apt-get install cups-pdf~

- 用Firefox打印你要分享的网页，把页面设置为自定义的，高度设成足够高，比
  如120 inch，这样不会产生分页，你最后就能得到一张图片，而不需要自己拼
  页剪接。

- 打印机选之前安装的pdf打印机。

- 生成的pdf文件会在~/PDF目录下，我这边有点奇怪，需要print两遍才能打出来。

- 注意最后只打印你想要的那一页（用print preview看是哪一页，而不是全文打印）。

- 用imagemagick的convert把生成的pdf转成jpg：

  #+begin_example
  convert  -verbose -colorspace RGB -interlace none -density 300 -resize 33.3% share.pdf share.jpg
  #+end_example
  
  这里用-density 300做3倍的采样，再用-resize 33.3%做1/3的缩小，最后出来
  的图片质量就可以了。

  这是一个非常消耗内存的操作，如果你的pdf有n页而内存又不大的话甚至可能
  导致机器无法恢复响应。所以一定要保证之前打印的时候只打一页。

- 用gimp把jpg里不需要的部分剪去。
