how-to-do-long-twitter-cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>自己动手做长微博（推特），内嵌图片的</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="自己动手做长微博（推特），内嵌图片的"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-21 18:44:54 CST"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">自己动手做长微博（推特），内嵌图片的</h1>

<p>看到一个写得很好的网页，想分享给朋友，你可以直接在微博上发个链接，但这
样不如直接把网页转成一张图片发到微博上更能吸引人。
</p>
<p>
这个在Linux下用开源工具自己就可以做到。
</p>
<ul>
<li>安装cups-pdf： <code>apt-get install cups-pdf</code>

</li>
<li>用Firefox打印你要分享的网页，把页面设置为自定义的，高度设成足够高，比
  如120 inch，这样不会产生分页，你最后就能得到一张图片，而不需要自己拼
  页剪接。

</li>
<li>打印机选之前安装的pdf打印机。

</li>
<li>生成的pdf文件会在~/PDF目录下，我这边有点奇怪，需要print两遍才能打出来。

</li>
<li>注意最后只打印你想要的那一页（用print preview看是哪一页，而不是全文打印）。

</li>
<li>用imagemagick的convert把生成的pdf转成jpg：




<pre class="example">convert  -verbose -colorspace RGB      \
  -interlace none -density 300 -resize \
  33.3% share.pdf share.jpg
</pre>


<p>  
  这里用-density 300做3倍的采样，再用-resize 33.3%做1/3的缩小，最后出来
  的图片质量就可以了。
</p>
<p>
  这是一个非常消耗内存的操作，如果你的pdf有n页而内存又不大的话甚至可能
  导致机器无法恢复响应。所以一定要保证之前打印的时候只打一页。
</p>
</li>
<li>用gimp把jpg里不需要的部分剪去。
</li>
</ul>

</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
